GopalSaraf/Practicals/PSDL/include/proc/pic18lf56k42.h
#define                                 CPW11_bit           _BIT_ACCESS(SMT1CPWH,3)
// SMT1CPWH<CPW12>
extern volatile __bit                   CPW12               __at(0x1F8CC);	// @ (0x3F19 * 8 + 4)
#define                                 CPW12_bit           _BIT_ACCESS(SMT1CPWH,4)
// SMT1CPWH<CPW13>
extern volatile __bit                   CPW13               __at(0x1F8CD);	// @ (0x3F19 * 8 + 5)
#define                                 CPW13_bit           _BIT_ACCESS(SMT1CPWH,5)
// SMT1CPWH<CPW14>
extern volatile __bit                   CPW14               __at(0x1F8CE);	// @ (0x3F19 * 8 + 6)
#define                                 CPW14_bit           _BIT_ACCESS(SMT1CPWH,6)
// SMT1CPWH<CPW15>
extern volatile __bit                   CPW15               __at(0x1F8CF);	// @ (0x3F19 * 8 + 7)
#define                                 CPW15_bit           _BIT_ACCESS(SMT1CPWH,7)
// SMT1CPWU<CPW16>
extern volatile __bit                   CPW16               __at(0x1F8D0);	// @ (0x3F1A * 8 + 0)
#define                                 CPW16_bit           _BIT_ACCESS(SMT1CPWU,0)
// SMT1CPWU<CPW17>
extern volatile __bit                   CPW17               __at(0x1F8D1);	// @ (0x3F1A * 8 + 1)
#define                                 CPW17_bit           _BIT_ACCESS(SMT1CPWU,1)
// SMT1CPWU<CPW18>
extern volatile __bit                   CPW18               __at(0x1F8D2);	// @ (0x3F1A * 8 + 2)
#define                                 CPW18_bit           _BIT_ACCESS(SMT1CPWU,2)
// SMT1CPWU<CPW19>
extern volatile __bit                   CPW19               __at(0x1F8D3);	// @ (0x3F1A * 8 + 3)
#define                                 CPW19_bit           _BIT_ACCESS(SMT1CPWU,3)
// SMT1CPWL<CPW2>
extern volatile __bit                   CPW2                __at(0x1F8C2);	// @ (0x3F18 * 8 + 2)
#define                                 CPW2_bit            _BIT_ACCESS(SMT1CPWL,2)
// SMT1CPWU<CPW20>
extern volatile __bit                   CPW20               __at(0x1F8D4);	// @ (0x3F1A * 8 + 4)
#define                                 CPW20_bit           _BIT_ACCESS(SMT1CPWU,4)
// SMT1CPWU<CPW21>
extern volatile __bit                   CPW21               __at(0x1F8D5);	// @ (0x3F1A * 8 + 5)
#define                                 CPW21_bit           _BIT_ACCESS(SMT1CPWU,5)
// SMT1CPWU<CPW22>
extern volatile __bit                   CPW22               __at(0x1F8D6);	// @ (0x3F1A * 8 + 6)
#define                                 CPW22_bit           _BIT_ACCESS(SMT1CPWU,6)
// SMT1CPWU<CPW23>
extern volatile __bit                   CPW23               __at(0x1F8D7);	// @ (0x3F1A * 8 + 7)
#define                                 CPW23_bit           _BIT_ACCESS(SMT1CPWU,7)
// SMT1CPWL<CPW3>
extern volatile __bit                   CPW3                __at(0x1F8C3);	// @ (0x3F18 * 8 + 3)
#define                                 CPW3_bit            _BIT_ACCESS(SMT1CPWL,3)
// SMT1CPWL<CPW4>
extern volatile __bit                   CPW4                __at(0x1F8C4);	// @ (0x3F18 * 8 + 4)
#define                                 CPW4_bit            _BIT_ACCESS(SMT1CPWL,4)
// SMT1CPWL<CPW5>
extern volatile __bit                   CPW5                __at(0x1F8C5);	// @ (0x3F18 * 8 + 5)
#define                                 CPW5_bit            _BIT_ACCESS(SMT1CPWL,5)
// SMT1CPWL<CPW6>
extern volatile __bit                   CPW6                __at(0x1F8C6);	// @ (0x3F18 * 8 + 6)
#define                                 CPW6_bit            _BIT_ACCESS(SMT1CPWL,6)
// SMT1CPWL<CPW7>
extern volatile __bit                   CPW7                __at(0x1F8C7);	// @ (0x3F18 * 8 + 7)
#define                                 CPW7_bit            _BIT_ACCESS(SMT1CPWL,7)
// SMT1CPWH<CPW8>
extern volatile __bit                   CPW8                __at(0x1F8C8);	// @ (0x3F19 * 8 + 0)
#define                                 CPW8_bit            _BIT_ACCESS(SMT1CPWH,0)
// SMT1CPWH<CPW9>
extern volatile __bit                   CPW9                __at(0x1F8C9);	// @ (0x3F19 * 8 + 1)
#define                                 CPW9_bit            _BIT_ACCESS(SMT1CPWH,1)
// SMT1STAT<CPWUP>
extern volatile __bit                   CPWUP               __at(0x1F906);	// @ (0x3F20 * 8 + 6)
#define                                 CPWUP_bit           _BIT_ACCESS(SMT1STAT,6)
// CRCCON0<CRCEN>
extern volatile __bit                   CRCEN               __at(0x1CB47);	// @ (0x3968 * 8 + 7)
#define                                 CRCEN_bit           _BIT_ACCESS(CRCCON0,7)
// CRCCON0<CRCGO>
extern volatile __bit                   CRCGO               __at(0x1CB46);	// @ (0x3968 * 8 + 6)
#define                                 CRCGO_bit           _BIT_ACCESS(CRCCON0,6)
// PIE0<CRCIE>
extern volatile __bit                   CRCIE               __at(0x1CC86);	// @ (0x3990 * 8 + 6)
#define                                 CRCIE_bit           _BIT_ACCESS(PIE0,6)
// PIR0<CRCIF>
extern volatile __bit                   CRCIF               __at(0x1CD06);	// @ (0x39A0 * 8 + 6)
#define                                 CRCIF_bit           _BIT_ACCESS(PIR0,6)
// IPR0<CRCIP>
extern volatile __bit                   CRCIP               __at(0x1CC06);	// @ (0x3980 * 8 + 6)
#define                                 CRCIP_bit           _BIT_ACCESS(IPR0,6)
// PMD0<CRCMD>
extern volatile __bit                   CRCMD               __at(0x1CE04);	// @ (0x39C0 * 8 + 4)
#define                                 CRCMD_bit           _BIT_ACCESS(PMD0,4)
// ADCON2<CRS0>
extern volatile __bit                   CRS0                __at(0x1F7D4);	// @ (0x3EFA * 8 + 4)
#define                                 CRS0_bit            _BIT_ACCESS(ADCON2,4)
// ADCON2<CRS1>
extern volatile __bit                   CRS1                __at(0x1F7D5);	// @ (0x3EFA * 8 + 5)
#define                                 CRS1_bit            _BIT_ACCESS(ADCON2,5)
// ADCON2<CRS2>
extern volatile __bit                   CRS2                __at(0x1F7D6);	// @ (0x3EFA * 8 + 6)
#define                                 CRS2_bit            _BIT_ACCESS(ADCON2,6)
// ADCLK<CS5>
extern volatile __bit                   CS5                 __at(0x1F7FD);	// @ (0x3EFF * 8 + 5)
#define                                 CS5_bit             _BIT_ACCESS(ADCLK,5)
// SMT1CLK<CSEL0>
extern volatile __bit                   CSEL0               __at(0x1F908);	// @ (0x3F21 * 8 + 0)
#define                                 CSEL0_bit           _BIT_ACCESS(SMT1CLK,0)
// SMT1CLK<CSEL1>
extern volatile __bit                   CSEL1               __at(0x1F909);	// @ (0x3F21 * 8 + 1)
#define                                 CSEL1_bit           _BIT_ACCESS(SMT1CLK,1)
// SMT1CLK<CSEL2>
extern volatile __bit                   CSEL2               __at(0x1F90A);	// @ (0x3F21 * 8 + 2)
#define                                 CSEL2_bit           _BIT_ACCESS(SMT1CLK,2)
// OSCCON3<CSWHOLD>
extern volatile __bit                   CSWHOLD             __at(0x1CEDF);	// @ (0x39DB * 8 + 7)
#define                                 CSWHOLD_bit         _BIT_ACCESS(OSCCON3,7)
// PIE0<CSWIE>
extern volatile __bit                   CSWIE               __at(0x1CC83);	// @ (0x3990 * 8 + 3)
#define                                 CSWIE_bit           _BIT_ACCESS(PIE0,3)
// PIR0<CSWIF>
extern volatile __bit                   CSWIF               __at(0x1CD03);	// @ (0x39A0 * 8 + 3)
#define                                 CSWIF_bit           _BIT_ACCESS(PIR0,3)
// IPR0<CSWIP>
extern volatile __bit                   CSWIP               __at(0x1CC03);	// @ (0x3980 * 8 + 3)
#define                                 CSWIP_bit           _BIT_ACCESS(IPR0,3)
// CWG1CLK<CWG1CS>
extern volatile __bit                   CWG1CS              __at(0x1FA90);	// @ (0x3F52 * 8 + 0)
#define                                 CWG1CS_bit          _BIT_ACCESS(CWG1CLK,0)
// CWG1DBF<CWG1DBF0>
extern volatile __bit                   CWG1DBF0            __at(0x1FAA8);	// @ (0x3F55 * 8 + 0)
#define                                 CWG1DBF0_bit        _BIT_ACCESS(CWG1DBF,0)
// CWG1DBF<CWG1DBF1>
extern volatile __bit                   CWG1DBF1            __at(0x1FAA9);	// @ (0x3F55 * 8 + 1)
#define                                 CWG1DBF1_bit        _BIT_ACCESS(CWG1DBF,1)
// CWG1DBF<CWG1DBF2>
extern volatile __bit                   CWG1DBF2            __at(0x1FAAA);	// @ (0x3F55 * 8 + 2)
#define                                 CWG1DBF2_bit        _BIT_ACCESS(CWG1DBF,2)
// CWG1DBF<CWG1DBF3>
extern volatile __bit                   CWG1DBF3            __at(0x1FAAB);	// @ (0x3F55 * 8 + 3)
#define                                 CWG1DBF3_bit        _BIT_ACCESS(CWG1DBF,3)
// CWG1DBF<CWG1DBF4>
extern volatile __bit                   CWG1DBF4            __at(0x1FAAC);	// @ (0x3F55 * 8 + 4)
#define                                 CWG1DBF4_bit        _BIT_ACCESS(CWG1DBF,4)
// CWG1DBF<CWG1DBF5>
extern volatile __bit                   CWG1DBF5            __at(0x1FAAD);	// @ (0x3F55 * 8 + 5)
#define                                 CWG1DBF5_bit        _BIT_ACCESS(CWG1DBF,5)
// CWG1DBR<CWG1DBR0>
extern volatile __bit                   CWG1DBR0            __at(0x1FAA0);	// @ (0x3F54 * 8 + 0)
#define                                 CWG1DBR0_bit        _BIT_ACCESS(CWG1DBR,0)
// CWG1DBR<CWG1DBR1>
extern volatile __bit                   CWG1DBR1            __at(0x1FAA1);	// @ (0x3F54 * 8 + 1)
#define                                 CWG1DBR1_bit        _BIT_ACCESS(CWG1DBR,1)
// CWG1DBR<CWG1DBR2>
extern volatile __bit                   CWG1DBR2            __at(0x1FAA2);	// @ (0x3F54 * 8 + 2)
#define                                 CWG1DBR2_bit        _BIT_ACCESS(CWG1DBR,2)
// CWG1DBR<CWG1DBR3>
extern volatile __bit                   CWG1DBR3            __at(0x1FAA3);	// @ (0x3F54 * 8 + 3)
#define                                 CWG1DBR3_bit        _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<CWG1DBR4>
extern volatile __bit                   CWG1DBR4            __at(0x1FAA4);	// @ (0x3F54 * 8 + 4)
#define                                 CWG1DBR4_bit        _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<CWG1DBR5>
extern volatile __bit                   CWG1DBR5            __at(0x1FAA5);	// @ (0x3F54 * 8 + 5)
#define                                 CWG1DBR5_bit        _BIT_ACCESS(CWG1DBR,5)
// CWG1CON0<CWG1EN>
extern volatile __bit                   CWG1EN              __at(0x1FAB7);	// @ (0x3F56 * 8 + 7)
#define                                 CWG1EN_bit          _BIT_ACCESS(CWG1CON0,7)
// PIE4<CWG1IE>
extern volatile __bit                   CWG1IE              __at(0x1CCA6);	// @ (0x3994 * 8 + 6)
#define                                 CWG1IE_bit          _BIT_ACCESS(PIE4,6)
// PIR4<CWG1IF>
extern volatile __bit                   CWG1IF              __at(0x1CD26);	// @ (0x39A4 * 8 + 6)
#define                                 CWG1IF_bit          _BIT_ACCESS(PIR4,6)
// CWG1CON1<CWG1IN>
extern volatile __bit                   CWG1IN              __at(0x1FABD);	// @ (0x3F57 * 8 + 5)
#define                                 CWG1IN_bit          _BIT_ACCESS(CWG1CON1,5)
// IPR4<CWG1IP>
extern volatile __bit                   CWG1IP              __at(0x1CC26);	// @ (0x3984 * 8 + 6)
#define                                 CWG1IP_bit          _BIT_ACCESS(IPR4,6)
// CWG1CON0<CWG1LD>
extern volatile __bit                   CWG1LD              __at(0x1FAB6);	// @ (0x3F56 * 8 + 6)
#define                                 CWG1LD_bit          _BIT_ACCESS(CWG1CON0,6)
// CWG1AS0<CWG1LSAC0>
extern volatile __bit                   CWG1LSAC0           __at(0x1FAC2);	// @ (0x3F58 * 8 + 2)
#define                                 CWG1LSAC0_bit       _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<CWG1LSAC1>
extern volatile __bit                   CWG1LSAC1           __at(0x1FAC3);	// @ (0x3F58 * 8 + 3)
#define                                 CWG1LSAC1_bit       _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<CWG1LSBD0>
extern volatile __bit                   CWG1LSBD0           __at(0x1FAC4);	// @ (0x3F58 * 8 + 4)
#define                                 CWG1LSBD0_bit       _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<CWG1LSBD1>
extern volatile __bit                   CWG1LSBD1           __at(0x1FAC5);	// @ (0x3F58 * 8 + 5)
#define                                 CWG1LSBD1_bit       _BIT_ACCESS(CWG1AS0,5)
// CWG1AS0<CWG1LSDB0>
extern volatile __bit                   CWG1LSDB0           __at(0x1FAC4);	// @ (0x3F58 * 8 + 4)
#define                                 CWG1LSDB0_bit       _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<CWG1LSDB1>
extern volatile __bit                   CWG1LSDB1           __at(0x1FAC5);	// @ (0x3F58 * 8 + 5)
#define                                 CWG1LSDB1_bit       _BIT_ACCESS(CWG1AS0,5)
// PMD4<CWG1MD>
extern volatile __bit                   CWG1MD              __at(0x1CE25);	// @ (0x39C4 * 8 + 5)
#define                                 CWG1MD_bit          _BIT_ACCESS(PMD4,5)
// CWG1CON0<CWG1MODE0>
extern volatile __bit                   CWG1MODE0           __at(0x1FAB0);	// @ (0x3F56 * 8 + 0)
#define                                 CWG1MODE0_bit       _BIT_ACCESS(CWG1CON0,0)
// CWG1CON0<CWG1MODE1>
extern volatile __bit                   CWG1MODE1           __at(0x1FAB1);	// @ (0x3F56 * 8 + 1)
#define                                 CWG1MODE1_bit       _BIT_ACCESS(CWG1CON0,1)
// CWG1CON0<CWG1MODE2>
extern volatile __bit                   CWG1MODE2           __at(0x1FAB2);	// @ (0x3F56 * 8 + 2)
#define                                 CWG1MODE2_bit       _BIT_ACCESS(CWG1CON0,2)
// CWG1STR<CWG1OVRA>
extern volatile __bit                   CWG1OVRA            __at(0x1FAD4);	// @ (0x3F5A * 8 + 4)
#define                                 CWG1OVRA_bit        _BIT_ACCESS(CWG1STR,4)
// CWG1STR<CWG1OVRB>
extern volatile __bit                   CWG1OVRB            __at(0x1FAD5);	// @ (0x3F5A * 8 + 5)
#define                                 CWG1OVRB_bit        _BIT_ACCESS(CWG1STR,5)
// CWG1STR<CWG1OVRC>
extern volatile __bit                   CWG1OVRC            __at(0x1FAD6);	// @ (0x3F5A * 8 + 6)
#define                                 CWG1OVRC_bit        _BIT_ACCESS(CWG1STR,6)
// CWG1STR<CWG1OVRD>
extern volatile __bit                   CWG1OVRD            __at(0x1FAD7);	// @ (0x3F5A * 8 + 7)
#define                                 CWG1OVRD_bit        _BIT_ACCESS(CWG1STR,7)
// CWG1CON1<CWG1POLA>
extern volatile __bit                   CWG1POLA            __at(0x1FAB8);	// @ (0x3F57 * 8 + 0)
#define                                 CWG1POLA_bit        _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<CWG1POLB>
extern volatile __bit                   CWG1POLB            __at(0x1FAB9);	// @ (0x3F57 * 8 + 1)
#define                                 CWG1POLB_bit        _BIT_ACCESS(CWG1CON1,1)
// CWG1CON1<CWG1POLC>
extern volatile __bit                   CWG1POLC            __at(0x1FABA);	// @ (0x3F57 * 8 + 2)
#define                                 CWG1POLC_bit        _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<CWG1POLD>
extern volatile __bit                   CWG1POLD            __at(0x1FABB);	// @ (0x3F57 * 8 + 3)
#define                                 CWG1POLD_bit        _BIT_ACCESS(CWG1CON1,3)
// CWG1STR<CWG1STRA>
extern volatile __bit                   CWG1STRA            __at(0x1FAD0);	// @ (0x3F5A * 8 + 0)
#define                                 CWG1STRA_bit        _BIT_ACCESS(CWG1STR,0)
// CWG1STR<CWG1STRB>
extern volatile __bit                   CWG1STRB            __at(0x1FAD1);	// @ (0x3F5A * 8 + 1)
#define                                 CWG1STRB_bit        _BIT_ACCESS(CWG1STR,1)
// CWG1STR<CWG1STRC>
extern volatile __bit                   CWG1STRC            __at(0x1FAD2);	// @ (0x3F5A * 8 + 2)
#define                                 CWG1STRC_bit        _BIT_ACCESS(CWG1STR,2)
// CWG1STR<CWG1STRD>
extern volatile __bit                   CWG1STRD            __at(0x1FAD3);	// @ (0x3F5A * 8 + 3)
#define                                 CWG1STRD_bit        _BIT_ACCESS(CWG1STR,3)
// CWG2CLK<CWG2CS>
extern volatile __bit                   CWG2CS              __at(0x1FA48);	// @ (0x3F49 * 8 + 0)
#define                                 CWG2CS_bit          _BIT_ACCESS(CWG2CLK,0)
// CWG2DBF<CWG2DBF0>
extern volatile __bit                   CWG2DBF0            __at(0x1FA60);	// @ (0x3F4C * 8 + 0)
#define                                 CWG2DBF0_bit        _BIT_ACCESS(CWG2DBF,0)
// CWG2DBF<CWG2DBF1>
extern volatile __bit                   CWG2DBF1            __at(0x1FA61);	// @ (0x3F4C * 8 + 1)
#define                                 CWG2DBF1_bit        _BIT_ACCESS(CWG2DBF,1)
// CWG2DBF<CWG2DBF2>
extern volatile __bit                   CWG2DBF2            __at(0x1FA62);	// @ (0x3F4C * 8 + 2)
#define                                 CWG2DBF2_bit        _BIT_ACCESS(CWG2DBF,2)
// CWG2DBF<CWG2DBF3>
extern volatile __bit                   CWG2DBF3            __at(0x1FA63);	// @ (0x3F4C * 8 + 3)
#define                                 CWG2DBF3_bit        _BIT_ACCESS(CWG2DBF,3)
// CWG2DBF<CWG2DBF4>
extern volatile __bit                   CWG2DBF4            __at(0x1FA64);	// @ (0x3F4C * 8 + 4)
#define                                 CWG2DBF4_bit        _BIT_ACCESS(CWG2DBF,4)
// CWG2DBF<CWG2DBF5>
extern volatile __bit                   CWG2DBF5            __at(0x1FA65);	// @ (0x3F4C * 8 + 5)
#define                                 CWG2DBF5_bit        _BIT_ACCESS(CWG2DBF,5)
// CWG2DBR<CWG2DBR0>
extern volatile __bit                   CWG2DBR0            __at(0x1FA58);	// @ (0x3F4B * 8 + 0)
#define                                 CWG2DBR0_bit        _BIT_ACCESS(CWG2DBR,0)
// CWG2DBR<CWG2DBR1>
extern volatile __bit                   CWG2DBR1            __at(0x1FA59);	// @ (0x3F4B * 8 + 1)
#define                                 CWG2DBR1_bit        _BIT_ACCESS(CWG2DBR,1)
// CWG2DBR<CWG2DBR2>
extern volatile __bit                   CWG2DBR2            __at(0x1FA5A);	// @ (0x3F4B * 8 + 2)
#define                                 CWG2DBR2_bit        _BIT_ACCESS(CWG2DBR,2)
// CWG2DBR<CWG2DBR3>
extern volatile __bit                   CWG2DBR3            __at(0x1FA5B);	// @ (0x3F4B * 8 + 3)
#define                                 CWG2DBR3_bit        _BIT_ACCESS(CWG2DBR,3)
// CWG2DBR<CWG2DBR4>
extern volatile __bit                   CWG2DBR4            __at(0x1FA5C);	// @ (0x3F4B * 8 + 4)
#define                                 CWG2DBR4_bit        _BIT_ACCESS(CWG2DBR,4)
// CWG2DBR<CWG2DBR5>
extern volatile __bit                   CWG2DBR5            __at(0x1FA5D);	// @ (0x3F4B * 8 + 5)
#define                                 CWG2DBR5_bit        _BIT_ACCESS(CWG2DBR,5)
// CWG2CON0<CWG2EN>
extern volatile __bit                   CWG2EN              __at(0x1FA6F);	// @ (0x3F4D * 8 + 7)
#define                                 CWG2EN_bit          _BIT_ACCESS(CWG2CON0,7)
// PIE7<CWG2IE>
extern volatile __bit                   CWG2IE              __at(0x1CCBB);	// @ (0x3997 * 8 + 3)
#define                                 CWG2IE_bit          _BIT_ACCESS(PIE7,3)
// PIR7<CWG2IF>
extern volatile __bit                   CWG2IF              __at(0x1CD3B);	// @ (0x39A7 * 8 + 3)
#define                                 CWG2IF_bit          _BIT_ACCESS(PIR7,3)
// CWG2CON1<CWG2IN>
extern volatile __bit                   CWG2IN              __at(0x1FA75);	// @ (0x3F4E * 8 + 5)
#define                                 CWG2IN_bit          _BIT_ACCESS(CWG2CON1,5)
// IPR7<CWG2IP>
extern volatile __bit                   CWG2IP              __at(0x1CC3B);	// @ (0x3987 * 8 + 3)
#define                                 CWG2IP_bit          _BIT_ACCESS(IPR7,3)
// CWG2CON0<CWG2LD>
extern volatile __bit                   CWG2LD              __at(0x1FA6E);	// @ (0x3F4D * 8 + 6)
#define                                 CWG2LD_bit          _BIT_ACCESS(CWG2CON0,6)
// CWG2AS0<CWG2LSAC0>
extern volatile __bit                   CWG2LSAC0           __at(0x1FA7A);	// @ (0x3F4F * 8 + 2)
#define                                 CWG2LSAC0_bit       _BIT_ACCESS(CWG2AS0,2)
// CWG2AS0<CWG2LSAC1>
extern volatile __bit                   CWG2LSAC1           __at(0x1FA7B);	// @ (0x3F4F * 8 + 3)
#define                                 CWG2LSAC1_bit       _BIT_ACCESS(CWG2AS0,3)
// CWG2AS0<CWG2LSBD0>
extern volatile __bit                   CWG2LSBD0           __at(0x1FA7C);	// @ (0x3F4F * 8 + 4)
#define                                 CWG2LSBD0_bit       _BIT_ACCESS(CWG2AS0,4)
// CWG2AS0<CWG2LSBD1>
extern volatile __bit                   CWG2LSBD1           __at(0x1FA7D);	// @ (0x3F4F * 8 + 5)
#define                                 CWG2LSBD1_bit       _BIT_ACCESS(CWG2AS0,5)
// CWG2AS0<CWG2LSDB0>
extern volatile __bit                   CWG2LSDB0           __at(0x1FA7C);	// @ (0x3F4F * 8 + 4)
#define                                 CWG2LSDB0_bit       _BIT_ACCESS(CWG2AS0,4)
// CWG2AS0<CWG2LSDB1>
extern volatile __bit                   CWG2LSDB1           __at(0x1FA7D);	// @ (0x3F4F * 8 + 5)
#define                                 CWG2LSDB1_bit       _BIT_ACCESS(CWG2AS0,5)
// PMD4<CWG2MD>
extern volatile __bit                   CWG2MD              __at(0x1CE26);	// @ (0x39C4 * 8 + 6)
#define                                 CWG2MD_bit          _BIT_ACCESS(PMD4,6)
// CWG2CON0<CWG2MODE0>
extern volatile __bit                   CWG2MODE0           __at(0x1FA68);	// @ (0x3F4D * 8 + 0)
#define                                 CWG2MODE0_bit       _BIT_ACCESS(CWG2CON0,0)
// CWG2CON0<CWG2MODE1>
extern volatile __bit                   CWG2MODE1           __at(0x1FA69);	// @ (0x3F4D * 8 + 1)
#define                                 CWG2MODE1_bit       _BIT_ACCESS(CWG2CON0,1)
// CWG2CON0<CWG2MODE2>
extern volatile __bit                   CWG2MODE2           __at(0x1FA6A);	// @ (0x3F4D * 8 + 2)
#define                                 CWG2MODE2_bit       _BIT_ACCESS(CWG2CON0,2)
// CWG2STR<CWG2OVRA>
extern volatile __bit                   CWG2OVRA            __at(0x1FA8C);	// @ (0x3F51 * 8 + 4)
#define                                 CWG2OVRA_bit        _BIT_ACCESS(CWG2STR,4)
// CWG2STR<CWG2OVRB>
extern volatile __bit                   CWG2OVRB            __at(0x1FA8D);	// @ (0x3F51 * 8 + 5)
#define                                 CWG2OVRB_bit        _BIT_ACCESS(CWG2STR,5)
// CWG2STR<CWG2OVRC>
extern volatile __bit                   CWG2OVRC            __at(0x1FA8E);	// @ (0x3F51 * 8 + 6)
#define                                 CWG2OVRC_bit        _BIT_ACCESS(CWG2STR,6)
// CWG2STR<CWG2OVRD>
extern volatile __bit                   CWG2OVRD            __at(0x1FA8F);	// @ (0x3F51 * 8 + 7)
#define                                 CWG2OVRD_bit        _BIT_ACCESS(CWG2STR,7)
// CWG2CON1<CWG2POLA>
extern volatile __bit                   CWG2POLA            __at(0x1FA70);	// @ (0x3F4E * 8 + 0)
#define                                 CWG2POLA_bit        _BIT_ACCESS(CWG2CON1,0)
// CWG2CON1<CWG2POLB>
extern volatile __bit                   CWG2POLB            __at(0x1FA71);	// @ (0x3F4E * 8 + 1)
#define                                 CWG2POLB_bit        _BIT_ACCESS(CWG2CON1,1)
// CWG2CON1<CWG2POLC>
extern volatile __bit                   CWG2POLC            __at(0x1FA72);	// @ (0x3F4E * 8 + 2)
#define                                 CWG2POLC_bit        _BIT_ACCESS(CWG2CON1,2)
// CWG2CON1<CWG2POLD>
extern volatile __bit                   CWG2POLD            __at(0x1FA73);	// @ (0x3F4E * 8 + 3)
#define                                 CWG2POLD_bit        _BIT_ACCESS(CWG2CON1,3)
// CWG2STR<CWG2STRA>
extern volatile __bit                   CWG2STRA            __at(0x1FA88);	// @ (0x3F51 * 8 + 0)
#define                                 CWG2STRA_bit        _BIT_ACCESS(CWG2STR,0)
// CWG2STR<CWG2STRB>
extern volatile __bit                   CWG2STRB            __at(0x1FA89);	// @ (0x3F51 * 8 + 1)
#define                                 CWG2STRB_bit        _BIT_ACCESS(CWG2STR,1)
// CWG2STR<CWG2STRC>
extern volatile __bit                   CWG2STRC            __at(0x1FA8A);	// @ (0x3F51 * 8 + 2)
#define                                 CWG2STRC_bit        _BIT_ACCESS(CWG2STR,2)
// CWG2STR<CWG2STRD>
extern volatile __bit                   CWG2STRD            __at(0x1FA8B);	// @ (0x3F51 * 8 + 3)
