GopalSaraf/Practicals/PSDL/include/proc/pic18lf56k42.h
extern volatile __bit                   DMA1DPTR11          __at(0x1DF6B);	// @ (0x3BED * 8 + 3)
#define                                 DMA1DPTR11_bit      _BIT_ACCESS(DMA1DPTRH,3)
// DMA1DPTRH<DMA1DPTR12>
extern volatile __bit                   DMA1DPTR12          __at(0x1DF6C);	// @ (0x3BED * 8 + 4)
#define                                 DMA1DPTR12_bit      _BIT_ACCESS(DMA1DPTRH,4)
// DMA1DPTRH<DMA1DPTR13>
extern volatile __bit                   DMA1DPTR13          __at(0x1DF6D);	// @ (0x3BED * 8 + 5)
#define                                 DMA1DPTR13_bit      _BIT_ACCESS(DMA1DPTRH,5)
// DMA1DPTRH<DMA1DPTR14>
extern volatile __bit                   DMA1DPTR14          __at(0x1DF6E);	// @ (0x3BED * 8 + 6)
#define                                 DMA1DPTR14_bit      _BIT_ACCESS(DMA1DPTRH,6)
// DMA1DPTRH<DMA1DPTR15>
extern volatile __bit                   DMA1DPTR15          __at(0x1DF6F);	// @ (0x3BED * 8 + 7)
#define                                 DMA1DPTR15_bit      _BIT_ACCESS(DMA1DPTRH,7)
// DMA1DPTRL<DMA1DPTR2>
extern volatile __bit                   DMA1DPTR2           __at(0x1DF62);	// @ (0x3BEC * 8 + 2)
#define                                 DMA1DPTR2_bit       _BIT_ACCESS(DMA1DPTRL,2)
// DMA1DPTRL<DMA1DPTR3>
extern volatile __bit                   DMA1DPTR3           __at(0x1DF63);	// @ (0x3BEC * 8 + 3)
#define                                 DMA1DPTR3_bit       _BIT_ACCESS(DMA1DPTRL,3)
// DMA1DPTRL<DMA1DPTR4>
extern volatile __bit                   DMA1DPTR4           __at(0x1DF64);	// @ (0x3BEC * 8 + 4)
#define                                 DMA1DPTR4_bit       _BIT_ACCESS(DMA1DPTRL,4)
// DMA1DPTRL<DMA1DPTR5>
extern volatile __bit                   DMA1DPTR5           __at(0x1DF65);	// @ (0x3BEC * 8 + 5)
#define                                 DMA1DPTR5_bit       _BIT_ACCESS(DMA1DPTRL,5)
// DMA1DPTRL<DMA1DPTR6>
extern volatile __bit                   DMA1DPTR6           __at(0x1DF66);	// @ (0x3BEC * 8 + 6)
#define                                 DMA1DPTR6_bit       _BIT_ACCESS(DMA1DPTRL,6)
// DMA1DPTRL<DMA1DPTR7>
extern volatile __bit                   DMA1DPTR7           __at(0x1DF67);	// @ (0x3BEC * 8 + 7)
#define                                 DMA1DPTR7_bit       _BIT_ACCESS(DMA1DPTRL,7)
// DMA1DPTRH<DMA1DPTR8>
extern volatile __bit                   DMA1DPTR8           __at(0x1DF68);	// @ (0x3BED * 8 + 0)
#define                                 DMA1DPTR8_bit       _BIT_ACCESS(DMA1DPTRH,0)
// DMA1DPTRH<DMA1DPTR9>
extern volatile __bit                   DMA1DPTR9           __at(0x1DF69);	// @ (0x3BED * 8 + 1)
#define                                 DMA1DPTR9_bit       _BIT_ACCESS(DMA1DPTRH,1)
// DMA1DSAL<DMA1DSA0>
extern volatile __bit                   DMA1DSA0            __at(0x1DF80);	// @ (0x3BF0 * 8 + 0)
#define                                 DMA1DSA0_bit        _BIT_ACCESS(DMA1DSAL,0)
// DMA1DSAL<DMA1DSA1>
extern volatile __bit                   DMA1DSA1            __at(0x1DF81);	// @ (0x3BF0 * 8 + 1)
#define                                 DMA1DSA1_bit        _BIT_ACCESS(DMA1DSAL,1)
// DMA1DSAH<DMA1DSA10>
extern volatile __bit                   DMA1DSA10           __at(0x1DF8A);	// @ (0x3BF1 * 8 + 2)
#define                                 DMA1DSA10_bit       _BIT_ACCESS(DMA1DSAH,2)
// DMA1DSAH<DMA1DSA11>
extern volatile __bit                   DMA1DSA11           __at(0x1DF8B);	// @ (0x3BF1 * 8 + 3)
#define                                 DMA1DSA11_bit       _BIT_ACCESS(DMA1DSAH,3)
// DMA1DSAH<DMA1DSA12>
extern volatile __bit                   DMA1DSA12           __at(0x1DF8C);	// @ (0x3BF1 * 8 + 4)
#define                                 DMA1DSA12_bit       _BIT_ACCESS(DMA1DSAH,4)
// DMA1DSAH<DMA1DSA13>
extern volatile __bit                   DMA1DSA13           __at(0x1DF8D);	// @ (0x3BF1 * 8 + 5)
#define                                 DMA1DSA13_bit       _BIT_ACCESS(DMA1DSAH,5)
// DMA1DSAH<DMA1DSA14>
extern volatile __bit                   DMA1DSA14           __at(0x1DF8E);	// @ (0x3BF1 * 8 + 6)
#define                                 DMA1DSA14_bit       _BIT_ACCESS(DMA1DSAH,6)
// DMA1DSAH<DMA1DSA15>
extern volatile __bit                   DMA1DSA15           __at(0x1DF8F);	// @ (0x3BF1 * 8 + 7)
#define                                 DMA1DSA15_bit       _BIT_ACCESS(DMA1DSAH,7)
// DMA1DSAL<DMA1DSA2>
extern volatile __bit                   DMA1DSA2            __at(0x1DF82);	// @ (0x3BF0 * 8 + 2)
#define                                 DMA1DSA2_bit        _BIT_ACCESS(DMA1DSAL,2)
// DMA1DSAL<DMA1DSA3>
extern volatile __bit                   DMA1DSA3            __at(0x1DF83);	// @ (0x3BF0 * 8 + 3)
#define                                 DMA1DSA3_bit        _BIT_ACCESS(DMA1DSAL,3)
// DMA1DSAL<DMA1DSA4>
extern volatile __bit                   DMA1DSA4            __at(0x1DF84);	// @ (0x3BF0 * 8 + 4)
#define                                 DMA1DSA4_bit        _BIT_ACCESS(DMA1DSAL,4)
// DMA1DSAL<DMA1DSA5>
extern volatile __bit                   DMA1DSA5            __at(0x1DF85);	// @ (0x3BF0 * 8 + 5)
#define                                 DMA1DSA5_bit        _BIT_ACCESS(DMA1DSAL,5)
// DMA1DSAL<DMA1DSA6>
extern volatile __bit                   DMA1DSA6            __at(0x1DF86);	// @ (0x3BF0 * 8 + 6)
#define                                 DMA1DSA6_bit        _BIT_ACCESS(DMA1DSAL,6)
// DMA1DSAL<DMA1DSA7>
extern volatile __bit                   DMA1DSA7            __at(0x1DF87);	// @ (0x3BF0 * 8 + 7)
#define                                 DMA1DSA7_bit        _BIT_ACCESS(DMA1DSAL,7)
// DMA1DSAH<DMA1DSA8>
extern volatile __bit                   DMA1DSA8            __at(0x1DF88);	// @ (0x3BF1 * 8 + 0)
#define                                 DMA1DSA8_bit        _BIT_ACCESS(DMA1DSAH,0)
// DMA1DSAH<DMA1DSA9>
extern volatile __bit                   DMA1DSA9            __at(0x1DF89);	// @ (0x3BF1 * 8 + 1)
#define                                 DMA1DSA9_bit        _BIT_ACCESS(DMA1DSAH,1)
// DMA1DSZL<DMA1DSZ0>
extern volatile __bit                   DMA1DSZ0            __at(0x1DF70);	// @ (0x3BEE * 8 + 0)
#define                                 DMA1DSZ0_bit        _BIT_ACCESS(DMA1DSZL,0)
// DMA1DSZL<DMA1DSZ1>
extern volatile __bit                   DMA1DSZ1            __at(0x1DF71);	// @ (0x3BEE * 8 + 1)
#define                                 DMA1DSZ1_bit        _BIT_ACCESS(DMA1DSZL,1)
// DMA1DSZH<DMA1DSZ10>
extern volatile __bit                   DMA1DSZ10           __at(0x1DF7A);	// @ (0x3BEF * 8 + 2)
#define                                 DMA1DSZ10_bit       _BIT_ACCESS(DMA1DSZH,2)
// DMA1DSZH<DMA1DSZ11>
extern volatile __bit                   DMA1DSZ11           __at(0x1DF7B);	// @ (0x3BEF * 8 + 3)
#define                                 DMA1DSZ11_bit       _BIT_ACCESS(DMA1DSZH,3)
// DMA1DSZL<DMA1DSZ2>
extern volatile __bit                   DMA1DSZ2            __at(0x1DF72);	// @ (0x3BEE * 8 + 2)
#define                                 DMA1DSZ2_bit        _BIT_ACCESS(DMA1DSZL,2)
// DMA1DSZL<DMA1DSZ3>
extern volatile __bit                   DMA1DSZ3            __at(0x1DF73);	// @ (0x3BEE * 8 + 3)
#define                                 DMA1DSZ3_bit        _BIT_ACCESS(DMA1DSZL,3)
// DMA1DSZL<DMA1DSZ4>
extern volatile __bit                   DMA1DSZ4            __at(0x1DF74);	// @ (0x3BEE * 8 + 4)
#define                                 DMA1DSZ4_bit        _BIT_ACCESS(DMA1DSZL,4)
// DMA1DSZL<DMA1DSZ5>
extern volatile __bit                   DMA1DSZ5            __at(0x1DF75);	// @ (0x3BEE * 8 + 5)
#define                                 DMA1DSZ5_bit        _BIT_ACCESS(DMA1DSZL,5)
// DMA1DSZL<DMA1DSZ6>
extern volatile __bit                   DMA1DSZ6            __at(0x1DF76);	// @ (0x3BEE * 8 + 6)
#define                                 DMA1DSZ6_bit        _BIT_ACCESS(DMA1DSZL,6)
// DMA1DSZL<DMA1DSZ7>
extern volatile __bit                   DMA1DSZ7            __at(0x1DF77);	// @ (0x3BEE * 8 + 7)
#define                                 DMA1DSZ7_bit        _BIT_ACCESS(DMA1DSZL,7)
// DMA1DSZH<DMA1DSZ8>
extern volatile __bit                   DMA1DSZ8            __at(0x1DF78);	// @ (0x3BEF * 8 + 0)
#define                                 DMA1DSZ8_bit        _BIT_ACCESS(DMA1DSZH,0)
// DMA1DSZH<DMA1DSZ9>
extern volatile __bit                   DMA1DSZ9            __at(0x1DF79);	// @ (0x3BEF * 8 + 1)
#define                                 DMA1DSZ9_bit        _BIT_ACCESS(DMA1DSZH,1)
// DMA1CON0<DMA1EN>
extern volatile __bit                   DMA1EN              __at(0x1DFE7);	// @ (0x3BFC * 8 + 7)
#define                                 DMA1EN_bit          _BIT_ACCESS(DMA1CON0,7)
// PMD7<DMA1MD>
extern volatile __bit                   DMA1MD              __at(0x1CE38);	// @ (0x39C7 * 8 + 0)
#define                                 DMA1MD_bit          _BIT_ACCESS(PMD7,0)
// PIE2<DMA1ORIE>
extern volatile __bit                   DMA1ORIE            __at(0x1CC92);	// @ (0x3992 * 8 + 2)
#define                                 DMA1ORIE_bit        _BIT_ACCESS(PIE2,2)
// PIR2<DMA1ORIF>
extern volatile __bit                   DMA1ORIF            __at(0x1CD12);	// @ (0x39A2 * 8 + 2)
#define                                 DMA1ORIF_bit        _BIT_ACCESS(PIR2,2)
// IPR2<DMA1ORIP>
extern volatile __bit                   DMA1ORIP            __at(0x1CC12);	// @ (0x3982 * 8 + 2)
#define                                 DMA1ORIP_bit        _BIT_ACCESS(IPR2,2)
// DMA1PR<DMA1PR0>
extern volatile __bit                   DMA1PR0             __at(0x1CF98);	// @ (0x39F3 * 8 + 0)
#define                                 DMA1PR0_bit         _BIT_ACCESS(DMA1PR,0)
// DMA1PR<DMA1PR1>
extern volatile __bit                   DMA1PR1             __at(0x1CF99);	// @ (0x39F3 * 8 + 1)
#define                                 DMA1PR1_bit         _BIT_ACCESS(DMA1PR,1)
// DMA1PR<DMA1PR2>
extern volatile __bit                   DMA1PR2             __at(0x1CF9A);	// @ (0x39F3 * 8 + 2)
#define                                 DMA1PR2_bit         _BIT_ACCESS(DMA1PR,2)
// DMA1SCNTL<DMA1SCNT0>
extern volatile __bit                   DMA1SCNT0           __at(0x1DF90);	// @ (0x3BF2 * 8 + 0)
#define                                 DMA1SCNT0_bit       _BIT_ACCESS(DMA1SCNTL,0)
// DMA1SCNTL<DMA1SCNT1>
extern volatile __bit                   DMA1SCNT1           __at(0x1DF91);	// @ (0x3BF2 * 8 + 1)
#define                                 DMA1SCNT1_bit       _BIT_ACCESS(DMA1SCNTL,1)
// DMA1SCNTH<DMA1SCNT10>
extern volatile __bit                   DMA1SCNT10          __at(0x1DF9A);	// @ (0x3BF3 * 8 + 2)
#define                                 DMA1SCNT10_bit      _BIT_ACCESS(DMA1SCNTH,2)
// DMA1SCNTH<DMA1SCNT11>
extern volatile __bit                   DMA1SCNT11          __at(0x1DF9B);	// @ (0x3BF3 * 8 + 3)
#define                                 DMA1SCNT11_bit      _BIT_ACCESS(DMA1SCNTH,3)
// DMA1SCNTL<DMA1SCNT2>
extern volatile __bit                   DMA1SCNT2           __at(0x1DF92);	// @ (0x3BF2 * 8 + 2)
#define                                 DMA1SCNT2_bit       _BIT_ACCESS(DMA1SCNTL,2)
// DMA1SCNTL<DMA1SCNT3>
extern volatile __bit                   DMA1SCNT3           __at(0x1DF93);	// @ (0x3BF2 * 8 + 3)
#define                                 DMA1SCNT3_bit       _BIT_ACCESS(DMA1SCNTL,3)
// DMA1SCNTL<DMA1SCNT4>
extern volatile __bit                   DMA1SCNT4           __at(0x1DF94);	// @ (0x3BF2 * 8 + 4)
#define                                 DMA1SCNT4_bit       _BIT_ACCESS(DMA1SCNTL,4)
// DMA1SCNTL<DMA1SCNT5>
extern volatile __bit                   DMA1SCNT5           __at(0x1DF95);	// @ (0x3BF2 * 8 + 5)
#define                                 DMA1SCNT5_bit       _BIT_ACCESS(DMA1SCNTL,5)
// DMA1SCNTL<DMA1SCNT6>
extern volatile __bit                   DMA1SCNT6           __at(0x1DF96);	// @ (0x3BF2 * 8 + 6)
#define                                 DMA1SCNT6_bit       _BIT_ACCESS(DMA1SCNTL,6)
// DMA1SCNTL<DMA1SCNT7>
extern volatile __bit                   DMA1SCNT7           __at(0x1DF97);	// @ (0x3BF2 * 8 + 7)
#define                                 DMA1SCNT7_bit       _BIT_ACCESS(DMA1SCNTL,7)
// DMA1SCNTH<DMA1SCNT8>
extern volatile __bit                   DMA1SCNT8           __at(0x1DF98);	// @ (0x3BF3 * 8 + 0)
#define                                 DMA1SCNT8_bit       _BIT_ACCESS(DMA1SCNTH,0)
// DMA1SCNTH<DMA1SCNT9>
extern volatile __bit                   DMA1SCNT9           __at(0x1DF99);	// @ (0x3BF3 * 8 + 1)
#define                                 DMA1SCNT9_bit       _BIT_ACCESS(DMA1SCNTH,1)
// PIE2<DMA1SCNTIE>
extern volatile __bit                   DMA1SCNTIE          __at(0x1CC90);	// @ (0x3992 * 8 + 0)
#define                                 DMA1SCNTIE_bit      _BIT_ACCESS(PIE2,0)
// PIR2<DMA1SCNTIF>
extern volatile __bit                   DMA1SCNTIF          __at(0x1CD10);	// @ (0x39A2 * 8 + 0)
#define                                 DMA1SCNTIF_bit      _BIT_ACCESS(PIR2,0)
// IPR2<DMA1SCNTIP>
extern volatile __bit                   DMA1SCNTIP          __at(0x1CC10);	// @ (0x3982 * 8 + 0)
#define                                 DMA1SCNTIP_bit      _BIT_ACCESS(IPR2,0)
// DMA1SIRQ<DMA1SIRQ0>
extern volatile __bit                   DMA1SIRQ0           __at(0x1DFF8);	// @ (0x3BFF * 8 + 0)
#define                                 DMA1SIRQ0_bit       _BIT_ACCESS(DMA1SIRQ,0)
// DMA1SIRQ<DMA1SIRQ1>
extern volatile __bit                   DMA1SIRQ1           __at(0x1DFF9);	// @ (0x3BFF * 8 + 1)
#define                                 DMA1SIRQ1_bit       _BIT_ACCESS(DMA1SIRQ,1)
// DMA1SIRQ<DMA1SIRQ2>
extern volatile __bit                   DMA1SIRQ2           __at(0x1DFFA);	// @ (0x3BFF * 8 + 2)
#define                                 DMA1SIRQ2_bit       _BIT_ACCESS(DMA1SIRQ,2)
// DMA1SIRQ<DMA1SIRQ3>
extern volatile __bit                   DMA1SIRQ3           __at(0x1DFFB);	// @ (0x3BFF * 8 + 3)
#define                                 DMA1SIRQ3_bit       _BIT_ACCESS(DMA1SIRQ,3)
// DMA1SIRQ<DMA1SIRQ4>
extern volatile __bit                   DMA1SIRQ4           __at(0x1DFFC);	// @ (0x3BFF * 8 + 4)
#define                                 DMA1SIRQ4_bit       _BIT_ACCESS(DMA1SIRQ,4)
// DMA1SIRQ<DMA1SIRQ5>
extern volatile __bit                   DMA1SIRQ5           __at(0x1DFFD);	// @ (0x3BFF * 8 + 5)
#define                                 DMA1SIRQ5_bit       _BIT_ACCESS(DMA1SIRQ,5)
// DMA1SIRQ<DMA1SIRQ6>
extern volatile __bit                   DMA1SIRQ6           __at(0x1DFFE);	// @ (0x3BFF * 8 + 6)
#define                                 DMA1SIRQ6_bit       _BIT_ACCESS(DMA1SIRQ,6)
// DMA1CON0<DMA1SIRQEN>
extern volatile __bit                   DMA1SIRQEN          __at(0x1DFE6);	// @ (0x3BFC * 8 + 6)
#define                                 DMA1SIRQEN_bit      _BIT_ACCESS(DMA1CON0,6)
// DMA1SPTRL<DMA1SPTR0>
extern volatile __bit                   DMA1SPTR0           __at(0x1DFA0);	// @ (0x3BF4 * 8 + 0)
#define                                 DMA1SPTR0_bit       _BIT_ACCESS(DMA1SPTRL,0)
// DMA1SPTRL<DMA1SPTR1>
extern volatile __bit                   DMA1SPTR1           __at(0x1DFA1);	// @ (0x3BF4 * 8 + 1)
#define                                 DMA1SPTR1_bit       _BIT_ACCESS(DMA1SPTRL,1)
// DMA1SPTRH<DMA1SPTR10>
extern volatile __bit                   DMA1SPTR10          __at(0x1DFAA);	// @ (0x3BF5 * 8 + 2)
#define                                 DMA1SPTR10_bit      _BIT_ACCESS(DMA1SPTRH,2)
// DMA1SPTRH<DMA1SPTR11>
extern volatile __bit                   DMA1SPTR11          __at(0x1DFAB);	// @ (0x3BF5 * 8 + 3)
#define                                 DMA1SPTR11_bit      _BIT_ACCESS(DMA1SPTRH,3)
// DMA1SPTRH<DMA1SPTR12>
extern volatile __bit                   DMA1SPTR12          __at(0x1DFAC);	// @ (0x3BF5 * 8 + 4)
#define                                 DMA1SPTR12_bit      _BIT_ACCESS(DMA1SPTRH,4)
// DMA1SPTRH<DMA1SPTR13>
extern volatile __bit                   DMA1SPTR13          __at(0x1DFAD);	// @ (0x3BF5 * 8 + 5)
#define                                 DMA1SPTR13_bit      _BIT_ACCESS(DMA1SPTRH,5)
// DMA1SPTRH<DMA1SPTR14>
extern volatile __bit                   DMA1SPTR14          __at(0x1DFAE);	// @ (0x3BF5 * 8 + 6)
#define                                 DMA1SPTR14_bit      _BIT_ACCESS(DMA1SPTRH,6)
// DMA1SPTRH<DMA1SPTR15>
extern volatile __bit                   DMA1SPTR15          __at(0x1DFAF);	// @ (0x3BF5 * 8 + 7)
#define                                 DMA1SPTR15_bit      _BIT_ACCESS(DMA1SPTRH,7)
// DMA1SPTRU<DMA1SPTR16>
extern volatile __bit                   DMA1SPTR16          __at(0x1DFB0);	// @ (0x3BF6 * 8 + 0)
#define                                 DMA1SPTR16_bit      _BIT_ACCESS(DMA1SPTRU,0)
// DMA1SPTRU<DMA1SPTR17>
extern volatile __bit                   DMA1SPTR17          __at(0x1DFB1);	// @ (0x3BF6 * 8 + 1)
#define                                 DMA1SPTR17_bit      _BIT_ACCESS(DMA1SPTRU,1)
// DMA1SPTRU<DMA1SPTR18>
extern volatile __bit                   DMA1SPTR18          __at(0x1DFB2);	// @ (0x3BF6 * 8 + 2)
#define                                 DMA1SPTR18_bit      _BIT_ACCESS(DMA1SPTRU,2)
// DMA1SPTRU<DMA1SPTR19>
extern volatile __bit                   DMA1SPTR19          __at(0x1DFB3);	// @ (0x3BF6 * 8 + 3)
#define                                 DMA1SPTR19_bit      _BIT_ACCESS(DMA1SPTRU,3)
// DMA1SPTRL<DMA1SPTR2>
extern volatile __bit                   DMA1SPTR2           __at(0x1DFA2);	// @ (0x3BF4 * 8 + 2)
#define                                 DMA1SPTR2_bit       _BIT_ACCESS(DMA1SPTRL,2)
// DMA1SPTRU<DMA1SPTR20>
extern volatile __bit                   DMA1SPTR20          __at(0x1DFB4);	// @ (0x3BF6 * 8 + 4)
#define                                 DMA1SPTR20_bit      _BIT_ACCESS(DMA1SPTRU,4)
// DMA1SPTRU<DMA1SPTR21>
extern volatile __bit                   DMA1SPTR21          __at(0x1DFB5);	// @ (0x3BF6 * 8 + 5)
#define                                 DMA1SPTR21_bit      _BIT_ACCESS(DMA1SPTRU,5)
// DMA1SPTRL<DMA1SPTR3>
extern volatile __bit                   DMA1SPTR3           __at(0x1DFA3);	// @ (0x3BF4 * 8 + 3)
#define                                 DMA1SPTR3_bit       _BIT_ACCESS(DMA1SPTRL,3)
// DMA1SPTRL<DMA1SPTR4>
extern volatile __bit                   DMA1SPTR4           __at(0x1DFA4);	// @ (0x3BF4 * 8 + 4)
#define                                 DMA1SPTR4_bit       _BIT_ACCESS(DMA1SPTRL,4)
// DMA1SPTRL<DMA1SPTR5>
extern volatile __bit                   DMA1SPTR5           __at(0x1DFA5);	// @ (0x3BF4 * 8 + 5)
#define                                 DMA1SPTR5_bit       _BIT_ACCESS(DMA1SPTRL,5)
// DMA1SPTRL<DMA1SPTR6>
extern volatile __bit                   DMA1SPTR6           __at(0x1DFA6);	// @ (0x3BF4 * 8 + 6)
#define                                 DMA1SPTR6_bit       _BIT_ACCESS(DMA1SPTRL,6)
// DMA1SPTRL<DMA1SPTR7>
extern volatile __bit                   DMA1SPTR7           __at(0x1DFA7);	// @ (0x3BF4 * 8 + 7)
#define                                 DMA1SPTR7_bit       _BIT_ACCESS(DMA1SPTRL,7)
// DMA1SPTRH<DMA1SPTR8>
extern volatile __bit                   DMA1SPTR8           __at(0x1DFA8);	// @ (0x3BF5 * 8 + 0)
#define                                 DMA1SPTR8_bit       _BIT_ACCESS(DMA1SPTRH,0)
// DMA1SPTRH<DMA1SPTR9>
extern volatile __bit                   DMA1SPTR9           __at(0x1DFA9);	// @ (0x3BF5 * 8 + 1)
#define                                 DMA1SPTR9_bit       _BIT_ACCESS(DMA1SPTRH,1)
// DMA1SSAL<DMA1SSA0>
extern volatile __bit                   DMA1SSA0            __at(0x1DFC8);	// @ (0x3BF9 * 8 + 0)
#define                                 DMA1SSA0_bit        _BIT_ACCESS(DMA1SSAL,0)
// DMA1SSAL<DMA1SSA1>
extern volatile __bit                   DMA1SSA1            __at(0x1DFC9);	// @ (0x3BF9 * 8 + 1)
#define                                 DMA1SSA1_bit        _BIT_ACCESS(DMA1SSAL,1)
// DMA1SSAH<DMA1SSA10>
extern volatile __bit                   DMA1SSA10           __at(0x1DFD2);	// @ (0x3BFA * 8 + 2)
#define                                 DMA1SSA10_bit       _BIT_ACCESS(DMA1SSAH,2)
// DMA1SSAH<DMA1SSA11>
extern volatile __bit                   DMA1SSA11           __at(0x1DFD3);	// @ (0x3BFA * 8 + 3)
#define                                 DMA1SSA11_bit       _BIT_ACCESS(DMA1SSAH,3)
// DMA1SSAH<DMA1SSA12>
extern volatile __bit                   DMA1SSA12           __at(0x1DFD4);	// @ (0x3BFA * 8 + 4)
#define                                 DMA1SSA12_bit       _BIT_ACCESS(DMA1SSAH,4)
// DMA1SSAH<DMA1SSA13>
extern volatile __bit                   DMA1SSA13           __at(0x1DFD5);	// @ (0x3BFA * 8 + 5)
#define                                 DMA1SSA13_bit       _BIT_ACCESS(DMA1SSAH,5)
// DMA1SSAH<DMA1SSA14>
extern volatile __bit                   DMA1SSA14           __at(0x1DFD6);	// @ (0x3BFA * 8 + 6)
#define                                 DMA1SSA14_bit       _BIT_ACCESS(DMA1SSAH,6)
// DMA1SSAH<DMA1SSA15>
extern volatile __bit                   DMA1SSA15           __at(0x1DFD7);	// @ (0x3BFA * 8 + 7)
#define                                 DMA1SSA15_bit       _BIT_ACCESS(DMA1SSAH,7)
// DMA1SSAU<DMA1SSA16>
extern volatile __bit                   DMA1SSA16           __at(0x1DFD8);	// @ (0x3BFB * 8 + 0)
#define                                 DMA1SSA16_bit       _BIT_ACCESS(DMA1SSAU,0)
// DMA1SSAU<DMA1SSA17>
extern volatile __bit                   DMA1SSA17           __at(0x1DFD9);	// @ (0x3BFB * 8 + 1)
#define                                 DMA1SSA17_bit       _BIT_ACCESS(DMA1SSAU,1)
// DMA1SSAU<DMA1SSA18>
extern volatile __bit                   DMA1SSA18           __at(0x1DFDA);	// @ (0x3BFB * 8 + 2)
#define                                 DMA1SSA18_bit       _BIT_ACCESS(DMA1SSAU,2)
// DMA1SSAU<DMA1SSA19>
extern volatile __bit                   DMA1SSA19           __at(0x1DFDB);	// @ (0x3BFB * 8 + 3)
#define                                 DMA1SSA19_bit       _BIT_ACCESS(DMA1SSAU,3)
// DMA1SSAL<DMA1SSA2>
extern volatile __bit                   DMA1SSA2            __at(0x1DFCA);	// @ (0x3BF9 * 8 + 2)
#define                                 DMA1SSA2_bit        _BIT_ACCESS(DMA1SSAL,2)
// DMA1SSAU<DMA1SSA20>
extern volatile __bit                   DMA1SSA20           __at(0x1DFDC);	// @ (0x3BFB * 8 + 4)
#define                                 DMA1SSA20_bit       _BIT_ACCESS(DMA1SSAU,4)
// DMA1SSAU<DMA1SSA21>
extern volatile __bit                   DMA1SSA21           __at(0x1DFDD);	// @ (0x3BFB * 8 + 5)
#define                                 DMA1SSA21_bit       _BIT_ACCESS(DMA1SSAU,5)
// DMA1SSAL<DMA1SSA3>
extern volatile __bit                   DMA1SSA3            __at(0x1DFCB);	// @ (0x3BF9 * 8 + 3)
#define                                 DMA1SSA3_bit        _BIT_ACCESS(DMA1SSAL,3)
// DMA1SSAL<DMA1SSA4>
extern volatile __bit                   DMA1SSA4            __at(0x1DFCC);	// @ (0x3BF9 * 8 + 4)
#define                                 DMA1SSA4_bit        _BIT_ACCESS(DMA1SSAL,4)
// DMA1SSAL<DMA1SSA5>
extern volatile __bit                   DMA1SSA5            __at(0x1DFCD);	// @ (0x3BF9 * 8 + 5)
#define                                 DMA1SSA5_bit        _BIT_ACCESS(DMA1SSAL,5)
// DMA1SSAL<DMA1SSA6>
extern volatile __bit                   DMA1SSA6            __at(0x1DFCE);	// @ (0x3BF9 * 8 + 6)
#define                                 DMA1SSA6_bit        _BIT_ACCESS(DMA1SSAL,6)
// DMA1SSAL<DMA1SSA7>
extern volatile __bit                   DMA1SSA7            __at(0x1DFCF);	// @ (0x3BF9 * 8 + 7)
#define                                 DMA1SSA7_bit        _BIT_ACCESS(DMA1SSAL,7)
// DMA1SSAH<DMA1SSA8>
extern volatile __bit                   DMA1SSA8            __at(0x1DFD0);	// @ (0x3BFA * 8 + 0)
#define                                 DMA1SSA8_bit        _BIT_ACCESS(DMA1SSAH,0)
// DMA1SSAH<DMA1SSA9>
extern volatile __bit                   DMA1SSA9            __at(0x1DFD1);	// @ (0x3BFA * 8 + 1)
#define                                 DMA1SSA9_bit        _BIT_ACCESS(DMA1SSAH,1)
// DMA1SSZL<DMA1SSZ0>
extern volatile __bit                   DMA1SSZ0            __at(0x1DFB8);	// @ (0x3BF7 * 8 + 0)
#define                                 DMA1SSZ0_bit        _BIT_ACCESS(DMA1SSZL,0)
// DMA1SSZL<DMA1SSZ1>
extern volatile __bit                   DMA1SSZ1            __at(0x1DFB9);	// @ (0x3BF7 * 8 + 1)
